# **Python for Data Science**

# Part -3: This is a Jupyter Notebook

Jupyter Notebooks are a popular alternative to a traditional Interactive Development Environment (IDE). Although they have their [detractors](https://twitter.com/joelgrus/status/1033035196428378113) they're generally a very good tool for teaching, displaying code and analysis, and interactively interacting with a running Python process.

In [1]:
# They allow you to write code in one cell:
2 + 2 == 5

False

And write text in the "Markdown" text formatting language in the next cell. 
```python
this looks like code, but it isn't!
```
[this is a hyperlink](https://xkcd.com/353/)
###### This is a small heading

### Some important things:
- Make sure your code cells are actually code cells, not Markdown cells.
- Figure out the difference between Edit Mode (green) and Command Mode (blue)
- Pay attention to code cell execution numbers and execution order
- Learn how to Restart & Run All

Handy shortcuts:
- Shift + enter = run cell and move to next
- Control + enter = run cell and stay at that cell

Command Mode shortcuts:
- b = Add a new cell
- Shift-click = Select multiple cells
- Shift-M = Merge cells
- Esc-y = Make cell code cell
- Esc-m = Make cell markdown cell
- Control-shift = Split cell at cursor

Edit Mode / Code shortcuts:
- Tab = Autocomplete
- Shift-tab = Bring up documentation (can press multiple times for *more* documentation)

# Part -2: Python 101 Review

You should be familiar with the basics of Python, including:
- How to call a function
- How to declare variables and assign function results to variables
- How to access elements of a list and a dictionary
- Understand the difference between functions, methods, and attributes (??)

You may also know how to:
- Define a function
- Implement control flow structures like `if`/`else` statements
- Make use of iteration in the form of `for` loops or list comprehensions

But we won't really be making use of those concepts today.

In [2]:
x = [3, 1, 2, 4]

In [3]:
# Take the sum of x
sum(x)

# Assign the result to y
y = sum(x)

In [4]:
y = {'Cohen':True, 'Flynn':True, 'Manafort':True, 'Giuliani':False}

In [5]:
# Access the value for 'Flynn'
y['Flynn']

# Change the value for 'Giuliani' to True
y['Giuliani'] = True
y

{'Cohen': True, 'Flynn': True, 'Manafort': True, 'Giuliani': True}

# Part -1: Same Background on Numpy
#### Methods and Attributes

This is adapted from [a notebook](Numpy - Pandas Ontology.ipynb) I wrote introducing Numpy and Pandas from a more fundamental perspective.

Everything is an *object* in Python. Objects may have attributes and methods:
- Attributes are called without a parentheses, because they require no arguments. You can think of them as accessing a pre-defined characteristic of that object, so no computation is generally required.
- Methods are functions that are specific to objects. When you call a method on an object, you are applying that function to the object, with some additional argument(s). Thus, they are called with parentheses.

Place your cursor to the right of `x.` below and you press `Tab`. You should see a list of available attributes and methods appear.

In [6]:
x.

In [7]:
# Apply the 'sort' method to x:
x.sort()

In [8]:
x

[1, 2, 3, 4]

(In another language, like R, this would look more like:
```
x = sort(x)
```
Where `sort` is a stand-alone function.)

#### Numpy

Numpy stands for 'numerical python,' and it was one of the first tools to turn Python into a data science programming language.

In [9]:
# Import the library:
import numpy as np

Numpy's main contribution to the Python world are *arrays*. Arrays are multi-dimensional collections of elements of the same type. Almost always the objects in an array are numbers. You can create an array from a list of Python lists:

In [10]:
A = np.array([[1,2,3],[4,5,6]])
A

array([[1, 2, 3],
       [4, 5, 6]])

Or you can create an array using a Numpy function, such as np.full:

In [11]:
# The first argument specifies the dimensions, the second tells Numpy what to fill the array with:
# This array is two-dimensional. Most arrays you see will be two dimensional, but remember that an
# array can contain data in any number of dimensions.
np.full((3,3), 8)

array([[8, 8, 8],
       [8, 8, 8],
       [8, 8, 8]])

In [12]:
# Note that A is an array:
type(A)

numpy.ndarray

In [13]:
# But the dtype of A is numeric:
A.dtype

# This is because the 'dtype' attribute of an array tells us the data type of the elements *inside* that array.
# Moving on, it will be helpful to remember the difference between the type of an object and the data type
# of the elements it contains.

dtype('int64')

Arrays have their own attributes and methods. You've already seen the dtype attribute.

In [14]:
# The mean method returns the average of the numbers inside the array:
A.mean()

3.5

In [15]:
# The sum method returns the sum:
A.sum()

21

In [16]:
# Side note:
sum(A) # This has unexpected results, basically, it sums along the rows of A.

array([5, 7, 9])

In [17]:
B = np.array([[0,1,0],[2,2,2]])
B

array([[0, 1, 0],
       [2, 2, 2]])

In [18]:
# Arrays can be added:
A + B

array([[1, 3, 3],
       [6, 7, 8]])

In [19]:
# And multiplied:
A * B

array([[ 0,  2,  0],
       [ 8, 10, 12]])

These operations are *element-wise*. That means that when we multiply two arrays, we are just multiplying all the corresponding elements from each array. (Provided the arrays have the same shape.)

You can't do this with Python lists!

In [20]:
[1, 2, 3] + [1, 2, 3] # Not what we wanted.

[1, 2, 3, 1, 2, 3]

Arrays have a certain number of dimensions, or *axes*:

In [21]:
A.ndim # A is two-dimensional. It has rows and columns.

2

In [22]:
A.shape # A has 2 rows and 3 columns.

(2, 3)

Just like Python lists, arrays can be indexed:

In [23]:
x[0] # 1 is the first element of the list X

1

In [24]:
# The first element of A is just a smaller array representing the first row of A:
A[0]

array([1, 2, 3])

In [25]:
# We index the array twice (if it is two-dimensional) to get to a particular element
A[0][0]

1

In [26]:
# Or we can pass in a tuple index:
A[(0,0)]

1

In addition to arrays, Numpy has almost all statistical functions you may have heard of:

In [27]:
np.mean([1,2,3])

2.0

In [28]:
np.std([1,3,7])

2.494438257849294

Indeed, Numpy is the library we use for most of these simple functions, even if we are operating on a list:

In [29]:
sum(x)/len(x) # Vanilla Python

2.5

In [30]:
np.mean(x) # Numpy!

2.5

#### Pandas

Pandas is a data manipulation library built on top of Numpy. Almost all of the time, you will use Pandas to store and interact with your data.

While Numpy gives us arrays to work with, Pandas provides Dataframes. A Dataframe is the basic tabular data structure you'll use in this course. Since they have rows and columns, they are always two-dimensional. Typically you will read in data from some source, like a CSV. But we can also construct them from scratch:

In [31]:
import pandas as pd

df = pd.DataFrame([[1,2,'A'],[3,4,'B'],[5,6,'C']])
df

   0  1  2
0  1  2  A
1  3  4  B
2  5  6  C

In [32]:
# Compare the dataframe above with an array constructed in the same way:
np.array([[1,2,'A'],[3,4,'B'],[5,6,'C']])

array([['1', '2', 'A'],
       ['3', '4', 'B'],
       ['5', '6', 'C']], dtype='<U21')

There are a few differences you should notice right away. Jupyter Notebooks displays Dataframes really nicely, whereas arrays are just shown as a list of lists.

Secondly, dataframes can contain elements of more than one type. Notice that Numpy treats all of the elements of the array as characters. Dataframes can hold data of different types in each column.

Lastly, the Dataframe is *labelled*. Each row and column has a label, or index. **Dataframes can be thought of as labeled two-dimensional Numpy arrays.**

Lets play with some of these features of dataframes.

In [33]:
# Because Pandas is based on Numpy, many of the methods are the same or similar.
# In Numpy .dtype returns the type of the elements in the array.
# In Pandas, .dtypes returns the data type of each column:
df.dtypes
# This will be one of the Pandas commands you use most often

0     int64
1     int64
2    object
dtype: object

In [34]:
# You can examine the shape a dataframe, just like you would with an array:
df.shape

(3, 3)

In [35]:
# Since dataframes are just labeled arrays, we can return the array
# that a dataframe is built on top of:
df.values

array([[1, 2, 'A'],
       [3, 4, 'B'],
       [5, 6, 'C']], dtype=object)

In [36]:
# The columns labels of a dataframe can be accessed:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [37]:
# And changed:
df.columns = ['Column One','Column Two','Column Three']
df

   Column One  Column Two Column Three
0           1           2            A
1           3           4            B
2           5           6            C

In [38]:
# The row labels of a dataframe are the index:
df.index
# Typically the index just counts up from 0, unless you've rearranged your data.

RangeIndex(start=0, stop=3, step=1)

In [39]:
# You can assign a new index to the data:
df.index = [3,4,5]

In [40]:
# Or you can choose a pre-existing column to be the index:
df.set_index('Column One')

# Side note about operations occuring in place:
# Notice that this operation hasn't occured 'in place.' Some Pandas
# operations occur in place, and others don't. You'll just have to remember
# which is which.

            Column Two Column Three
Column One
1                    2            A
3                    4            B
5                    6            C

In [41]:
# To select a certain column, just pass the name of the column to the square brackets which we 
# usually use for subsetting and indexing. If you want more than one column, pass a list of column names.

# This should look like accessing a value from a dictionary. In a way, DataFrames are dictionaries
# where the key is the column name and the value is the Series of data in the column.
df['Column One']

3    1
4    3
5    5
Name: Column One, dtype: int64

A Pandas series is just a one-dimensional collection of data. When you're working with dataframes, always remember that your columns are Pandas series:

In [42]:
type(df['Column One'])

pandas.core.series.Series

As you work with Pandas, remember that certain methods apply to series, and some to dataframes. For example, the methods dealing with setting the index operate on the entire dataframe.

In [43]:
# Take the mean of this column
df['Column One'].mean()

3.0

Pandas knows there are a lot of functions we might want to apply to all the columns, though, so it lets us just apply them directly to the dataframe:

In [44]:
df.max()

Column One      5
Column Two      6
Column Three    C
dtype: object

In [45]:
df.mean(axis=0)

Column One    3.0
Column Two    4.0
dtype: float64

Other times we might want to create new columns from our existing columns. We can work with the columns directly as series:

In [46]:
df['Column One'] * df['Column Two']

3     2
4    12
5    30
dtype: int64

# Part 0: Python for Data Science

We'll be working with a few key datasets throughout this session.

- MovieLens 100k movie rating data:
    - main page: http://grouplens.org/datasets/movielens/
    - data dictionary: http://files.grouplens.org/datasets/movielens/ml-100k-README.txt
- WHO alcohol consumption data:
    - article: http://fivethirtyeight.com/datalab/dear-mona-followup-where-do-people-drink-the-most-beer-wine-and-spirits/
    - original data: https://github.com/fivethirtyeight/data/tree/master/alcohol-consumption
    - original data from WHO: http://apps.who.int/gho/data/node.gisah.A1039?lang=en&showonly=GISAH
- National UFO Reporting Center data:
    - main page: http://www.nuforc.org/webreports.html

In [47]:
# the pandas library
import pandas as pd

## Reading Files, Selecting Columns, and Summarizing

### **Note: I have decided to use `.head()` or `.sample()` whenever I am returning an entire DataFrame or Series. This is so that I'm not printing out dozens or hundreds of values to Jupyter Notebook, which will make the finished notebook a pain to scroll through.**

In [48]:
# read in directly from the file
users = pd.read_table('u.user')

In [49]:
users.head(20)

   user_id|age|gender|occupation|zip_code
0                 1|24|M|technician|85711
1                      2|53|F|other|94043
2                     3|23|M|writer|32067
3                 4|24|M|technician|43537
4                      5|33|F|other|15213
5                  6|42|M|executive|98101
6              7|57|M|administrator|91344
7              8|36|M|administrator|05201
8                    9|29|M|student|01002
9                    10|53|M|lawyer|90703
10                    11|39|F|other|30329
11                    12|28|F|other|06405
12                 13|47|M|educator|29206
13                14|45|M|scientist|55106
14                 15|49|F|educator|97301
15            16|21|M|entertainment|10309
16               17|30|M|programmer|06355
17                    18|35|F|other|37212
18                19|40|M|librarian|02138
19                20|42|F|homemaker|95660

In [50]:
# read 'u.user' into 'users'
# With the appropriate delimiters and row labels
users = pd.read_table('https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/u.user', sep='|', index_col='user_id')

In [51]:
# examine the users data
users.head(20)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660

In [52]:
type(users)             # DataFrame

pandas.core.frame.DataFrame

In [53]:
users.head()            # print the first 5 rows

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [54]:
users.head(10)          # print the first 10 rows

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [55]:
users.tail()            # print the last 5 rows

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [56]:
users.sample(5)          # I like the sample method to return random rows

         age gender occupation zip_code
user_id
389       44      F     writer    83702
702       37      M      other    89104
598       40      F  marketing    43085
546       36      M  executive    22911
313       41      M  marketing    60035

In [57]:
users.index             # Index / row labels

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [58]:
users.columns           # column names (which is "an index")

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [59]:
users.dtypes            # data types of each column

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [60]:
users.shape             # number of rows and columns

(943, 4)

In [61]:
users.values            # underlying numpy array

array([[24, 'M', 'technician', '85711'],
       [53, 'F', 'other', '94043'],
       [23, 'M', 'writer', '32067'],
       ...,
       [20, 'M', 'student', '97229'],
       [48, 'F', 'librarian', '78209'],
       [22, 'M', 'student', '77841']], dtype=object)

#### Select a column

What's the difference between these two ways of accessing a single column?

In [62]:
users['gender'].head()  # Can accommodate spaces in column names, is more explicit

users.gender.head()     # select one column using the DataFrame attribute, but 
# fails if we have a column called "sum" or "mean"

user_id
1    M
2    F
3    M
4    M
5    F
Name: gender, dtype: object

#### Summarize (describe) the DataFrame

In [63]:
users.describe()                    # describe all numeric columns

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [64]:
users.describe(include=['object'])  # describe all object columns

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

In [65]:
users.describe(include='all')       # describe all columns

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

#### Summarize a Series

In [66]:
users.gender.describe()             # describe a single column

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [67]:
users.age.mean()                    # only calculate the mean

34.05196182396607

### Exercise One

#### Read drinks.csv into a DataFrame called 'drinks'
Data: https://raw.githubusercontent.com/josephofiowa/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv

In [68]:
drinks = pd.read_csv('https://raw.githubusercontent.com/josephofiowa/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv')

In [69]:
drinks.sample(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
89,Kiribati,21,34,1,1.0,OC
97,Libya,0,0,0,0.0,AF
32,Canada,240,122,100,8.2,NaN
168,Tajikistan,2,15,0,0.3,AS
80,Iraq,9,3,0,0.2,AS

#### Print the head and the tail

In [70]:
users.head()
users.tail()

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

#### Examine the default index, data types, and shape

In [71]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [72]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [73]:
users.shape

(943, 4)

#### Print the 'beer_servings' Series

In [74]:
drinks['beer_servings'].head()

0      0
1     89
2     25
3    245
4    217
Name: beer_servings, dtype: int64

#### Calculate the mean 'beer_servings' for the entire dataset

In [75]:
drinks['beer_servings'].mean()

106.16062176165804

#### Count the number of unique occurrences of each 'continent' value and see if it looks correct

In [76]:
drinks.continent.unique() # Where is North America?

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [77]:
drinks.continent.value_counts(dropna=False)

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

#### BONUS: display only the number of rows of the 'users' DataFrame

In [78]:
type(drinks.shape)

tuple

In [79]:
drinks.shape[0] # Num rows

193

In [80]:
drinks.shape[1] # Num columns. Tuple indexing!

6

#### BONUS: display the 3 most frequent occupations in 'users'

In [81]:
users['occupation'].value_counts().head(3)

student     196
other       105
educator     95
Name: occupation, dtype: int64

## Filtering and Sorting

#### Boolean filtering: only show users with age < 20

In [82]:
young_bool = users.age < 20         # create a Series of booleans...

In [83]:
young_bool.head()

user_id
1    False
2    False
3    False
4    False
5    False
Name: age, dtype: bool

In [84]:
type(young_bool)

pandas.core.series.Series

In [85]:
users[young_bool].head()                   # ...and use that Series to filter rows

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

In [86]:
users[users.age < 20].head()               # or, combine into a single step

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

In [87]:
users[users.age < 20].occupation.sample(10)  # select one column from the filtered results

user_id
609    student
904    student
631    student
674    student
747      other
434    student
57        none
787    student
453    student
289       none
Name: occupation, dtype: object

In [88]:
users[users.age < 20].occupation.value_counts()     # value_counts of resulting Series

student          64
other             4
none              3
entertainment     2
writer            2
artist            1
salesman          1
Name: occupation, dtype: int64

#### Boolean filtering with multiple conditions

In [89]:
users[(users.age < 20) & (users.gender=='M')].sample(5)       # ampersand for AND condition

         age gender occupation zip_code
user_id
461       15      M    student    98102
221       19      M    student    20685
624       19      M    student    30067
761       17      M    student    97302
582       17      M    student    93003

In [90]:
users[(users.age < 20) | (users.age > 60)]          # pipe for OR condition

         age gender     occupation zip_code
user_id
30         7      M        student    55436
36        19      F        student    93117
52        18      F        student    55105
57        16      M           none    84010
67        17      M        student    60402
68        19      M        student    22904
101       15      M        student    05146
106       61      M        retired    55125
110       19      M        student    77840
142       13      M          other    48118
179       15      M  entertainment    20755
206       14      F        student    53115
211       66      M       salesman    32605
221       19      M        student    20685
223       19      F        student    47906
246       19      M        student    28734
257       17      M        student    77005
258       19      F        student    77801
262       19      F        student    78264
266       62      F  administrator    78756
270       18      F        student    63119
281       15      F        student    06059
289       11      M           none    94619
291       19      M        student    44106
303       19      M        student    14853
318       65      M        retired    06518
320       19      M        student    24060
341       17      F        student    44405
347       18      M        student    90210
349       68      M        retired    61455
...      ...    ...            ...      ...
631       18      F        student    38866
632       18      M        student    55454
642       18      F        student    95521
646       17      F        student    51250
651       65      M        retired    02903
674       13      F        student    55337
700       17      M        student    76309
710       19      M        student    92020
729       19      M        student    56567
747       19      M          other    93612
761       17      M        student    97302
767       70      M       engineer    00000
777       63      M     programmer    01810
787       18      F        student    98620
803       70      M  administrator    78212
813       14      F        student    02136
817       19      M        student    60152
845       64      M         doctor    97405
849       15      F        student    25652
851       18      M          other    29646
858       63      M       educator    09645
859       18      F          other    06492
860       70      F        retired    48322
863       17      M        student    60089
872       19      F        student    74078
880       13      M        student    83702
887       14      F        student    27249
904       17      F        student    61073
925       18      F       salesman    49036
934       61      M       engineer    22902

[99 rows x 4 columns]

#### Sorting

In [91]:
# users.age.order()   # sort a column
users.age.sort_values(ascending=False).head(3)

user_id
481    73
860    70
803    70
Name: age, dtype: int64

In [92]:
users[['age','gender']].sample(5) # Include this earlier next time!

         age gender
user_id
630       26      F
63        31      M
10        53      M
141       49      M
219       32      M

In [93]:
users.sort_values(by=['age','gender']).tail()                   # sort a DataFrame by a single column

         age gender     occupation zip_code
user_id
585       69      M      librarian    98501
860       70      F        retired    48322
767       70      M       engineer    00000
803       70      M  administrator    78212
481       73      M        retired    37771

In [94]:
users.sort_values(by='age', ascending=False)  # use descending order instead

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501
559       69      M      executive    10022
349       68      M        retired    61455
573       68      M        retired    48911
211       66      M       salesman    32605
651       65      M        retired    02903
564       65      M        retired    94591
318       65      M        retired    06518
845       64      M         doctor    97405
423       64      M          other    91606
858       63      M       educator    09645
364       63      M       engineer    01810
777       63      M     programmer    01810
266       62      F  administrator    78756
520       62      M     healthcare    12603
934       61      M       engineer    22902
351       61      M       educator    49938
106       61      M        retired    55125
464       60      M         writer    94583
469       60      M       educator    78628
234       60      M        retired    94702
900       60      M        retired    18505
308       60      M        retired    95076
931       60      M       educator    33556
694       60      M     programmer    06365
752       60      M        retired    21201
...      ...    ...            ...      ...
700       17      M        student    76309
646       17      F        student    51250
863       17      M        student    60089
375       17      M  entertainment    37777
761       17      M        student    97302
621       17      M        student    60402
257       17      M        student    77005
904       17      F        student    61073
434       16      F        student    49705
451       16      M        student    48446
550       16      F        student    95453
57        16      M           none    84010
580       16      M        student    17961
179       15      M  entertainment    20755
461       15      M        student    98102
618       15      F        student    44212
849       15      F        student    25652
281       15      F        student    06059
101       15      M        student    05146
813       14      F        student    02136
887       14      F        student    27249
206       14      F        student    53115
628       13      M           none    94306
674       13      F        student    55337
142       13      M          other    48118
880       13      M        student    83702
609       13      F        student    55106
289       11      M           none    94619
471       10      M        student    77459
30         7      M        student    55436

[943 rows x 4 columns]

### Exercise Two

#### Filter 'drinks' to only include European countries

In [95]:
drinks[drinks.continent == 'EU'].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU

#### Filter 'drinks' to only include European countries with wine_servings > 300

In [96]:
drinks[(drinks.continent == 'EU') & (drinks.wine_servings > 300)].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

#### Calculate the mean 'beer_servings' for all of Europe

In [97]:
drinks[drinks.continent == 'EU'].beer_servings.mean()

193.77777777777777

#### Determine which 10 countries have the highest total_litres_of_pure_alcohol

In [98]:
drinks.sort_values(by='total_litres_of_pure_alcohol', ascending=False).head(10)

drinks.set_index('country')['total_litres_of_pure_alcohol'].sort_values(ascending=False).head(10).index

Index(['Belarus', 'Lithuania', 'Andorra', 'Grenada', 'Czech Republic',
       'France', 'Russian Federation', 'Ireland', 'Slovakia', 'Luxembourg'],
      dtype='object', name='country')

#### BONUS: sort 'users' by 'occupation' and then by 'age' (in a single command)

In [99]:
users.sort_values(['occupation','age']).head(3)

         age gender     occupation zip_code
user_id
118       21      M  administrator    90210
180       22      F  administrator    60202
282       22      M  administrator    20057

#### BONUS: filter 'users' to only include doctors and lawyers without using a |

In [100]:
parent_friendly_occupations = ['doctor','lawyer']
bool_mask = users['occupation'].isin(parent_friendly_occupations)

In [101]:
users[bool_mask]['age'].describe()

count    19.000000
mean     39.263158
std      11.627755
min      21.000000
25%      29.000000
50%      37.000000
75%      48.500000
max      64.000000
Name: age, dtype: float64

#### Hint: read the pandas.Series.isin documentation

## Renaming, Adding, and Removing Columns

#### Rename one or more columns

In [102]:
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'})

,country,beer,spirit_servings,wine,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NaN
6,Argentina,193,25,221,8.3,SA
7,Armenia,21,179,11,3.8,EU
8,Australia,261,72,212,10.4,OC
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU
11,Bahamas,122,176,51,6.3,NaN
12,Bahrain,42,63,7,2.0,AS
13,Bangladesh,0,0,0,0.0,AS
14,Barbados,143,173,36,6.3,NaN
15,Belarus,142,373,42,14.4,EU
16,Belgium,295,84,212,10.5,EU
17,Belize,263,114,8,6.8,NaN
18,Benin,34,4,13,1.1,AF
19,Bhutan,23,0,0,0.4,AS
20,Bolivia,167,41,8,3.8,SA
21,Bosnia-Herzegovina,76,173,8,4.6,EU
22,Botswana,173,35,35,5.4,AF
23,Brazil,245,145,16,7.2,SA
24,Brunei,31,2,1,0.6,AS
25,Bulgaria,231,252,94,10.3,EU
26,Burkina Faso,25,7,7,4.3,AF
27,Burundi,88,0,0,6.3,AF
28,Cote d'Ivoire,37,1,7,4.0,AF
29,Cabo Verde,144,56,16,4.0,AF
...,...,...,...,...,...,...
163,Suriname,128,178,7,5.6,SA
164,Swaziland,90,2,2,4.7,AF
165,Sweden,152,60,186,7.2,EU
166,Switzerland,185,100,280,10.2,EU
167,Syria,5,35,16,1.0,AS
168,Tajikistan,2,15,0,0.3,AS
169,Thailand,99,258,1,6.4,AS
170,Macedonia,106,27,86,3.9,EU
171,Timor-Leste,1,1,4,0.1,AS
172,Togo,36,2,19,1.3,AF
173,Tonga,36,21,5,1.1,OC
174,Trinidad & Tobago,197,156,7,6.4,NaN
175,Tunisia,51,3,20,1.3,AF
176,Turkey,51,22,7,1.4,AS
177,Turkmenistan,19,71,32,2.2,AS
178,Tuvalu,6,41,9,1.0,OC
179,Uganda,45,9,0,8.3,AF
180,Ukraine,206,237,45,8.9,EU
181,United Arab Emirates,16,135,5,2.8,AS
182,United Kingdom,219,126,195,10.4,EU
183,Tanzania,36,6,1,5.7,AF
184,USA,249,158,84,8.7,NaN
185,Uruguay,115,35,220,6.6,SA
186,Uzbekistan,25,101,8,2.4,AS
187,Vanuatu,21,18,11,0.9,OC
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [103]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [104]:
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

#### Replace all column names

In [105]:
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']

In [106]:
drinks.columns = drink_cols

In [107]:
drinks.head()

       country  beer  spirit  wine  liters continent
0  Afghanistan     0       0     0     0.0        AS
1      Albania    89     132    54     4.9        EU
2      Algeria    25       0    14     0.7        AF
3      Andorra   245     138   312    12.4        EU
4       Angola   217      57    45     5.9        AF

#### Replace all column names when reading the file

In [108]:
drinks = pd.read_csv('drinks.csv', header=0, names=drink_cols)

#### Add a new column as a function of existing columns

In [109]:
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine

In [110]:
drinks['mL'] = drinks.liters * 1000

In [111]:
drinks.head()

       country  beer  spirit  wine  liters continent  servings       mL
0  Afghanistan     0       0     0     0.0        AS         0      0.0
1      Albania    89     132    54     4.9        EU       275   4900.0
2      Algeria    25       0    14     0.7        AF        39    700.0
3      Andorra   245     138   312    12.4        EU       695  12400.0
4       Angola   217      57    45     5.9        AF       319   5900.0

#### Removing columns

In [112]:
drinks.drop('mL', axis=1).sample(10)                 # axis=0 for rows, 1 for columns

                      country  beer  spirit  wine  liters continent  servings
164                 Swaziland    90       2     2     4.7        AF        94
115                Mozambique    47      18     5     1.3        AF        70
78                  Indonesia     5       1     0     0.1        AS         6
185                   Uruguay   115      35   220     6.6        SA       370
105                     Malta   149     100   120     6.6        EU       369
33   Central African Republic    17       2     1     1.8        AF        20
139                   Moldova   109     226    18     6.3        EU       353
101                    Malawi     8      11     1     1.5        AF        20
25                   Bulgaria   231     252    94    10.3        EU       577
108                 Mauritius    98      31    18     2.6        AF       147

In [113]:
drinks.drop(['mL', 'servings'], axis=1, inplace=True)   # drop multiple columns

## Handling Missing Values

#### Missing values are usually excluded in methods by default

In [114]:
drinks.continent.value_counts()              # excludes missing values

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [115]:
drinks.continent.value_counts(dropna=False)  # includes missing values

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

#### Find missing values in a Series

In [116]:
drinks = pd.read_csv('https://raw.githubusercontent.com/josephofiowa/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv')

In [117]:
drinks.continent.notnull().sample(10)          # True if not missing

158     True
28      True
106     True
5      False
112     True
85      True
41     False
97      True
115     True
10      True
Name: continent, dtype: bool

In [118]:
drinks.continent.isnull().sample(10)   # True if missing

97     False
160    False
14      True
2      False
49     False
126    False
53     False
132    False
170    False
104    False
Name: continent, dtype: bool

#### Use a boolean Series to filter DataFrame rows

In [119]:
drinks[drinks.continent.isnull()].sample(10)   # only show rows where continent is missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
54,El Salvador,52,69,2,2.2,NaN
14,Barbados,143,173,36,6.3,NaN
122,Nicaragua,78,118,1,3.5,NaN
5,Antigua & Barbuda,102,128,45,4.9,NaN
68,Grenada,199,438,28,11.9,NaN
73,Haiti,1,326,1,5.9,NaN
43,Cuba,93,137,5,4.2,NaN
51,Dominican Republic,193,147,9,6.2,NaN
84,Jamaica,82,97,9,3.4,NaN
17,Belize,263,114,8,6.8,NaN

In [120]:
drinks[drinks.continent.notnull()].sample(10)  # only show rows where continent is not missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
40,Cook Islands,0,254,74,5.9,OC
107,Mauritania,0,0,0,0.0,AF
102,Malaysia,13,4,0,0.3,AS
65,Germany,346,117,175,11.3,EU
137,Qatar,1,42,7,0.9,AS
59,Fiji,77,35,1,2.0,OC
55,Equatorial Guinea,92,0,233,5.8,AF
124,Nigeria,42,5,2,9.1,AF
123,Niger,3,2,1,0.1,AF
154,Singapore,60,12,11,1.5,AS

#### Side note: understanding axes

In [121]:
drinks.sum()            # sums "down" the 0 axis (rows)

country                         AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...
beer_servings                                                               20489
spirit_servings                                                             15632
wine_servings                                                                9544
total_litres_of_pure_alcohol                                                910.4
dtype: object

In [122]:
drinks.sum(axis=0)      # equivalent (since axis=0 is the default)

country                         AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...
beer_servings                                                               20489
spirit_servings                                                             15632
wine_servings                                                                9544
total_litres_of_pure_alcohol                                                910.4
dtype: object

In [123]:
drinks.sum(axis=1)      # sums "across" the 1 axis (columns)

0        0.0
1      279.9
2       39.7
3      707.4
4      324.9
5      279.9
6      447.3
7      214.8
8      555.4
9      554.7
10      73.3
11     355.3
12     114.0
13       0.0
14     358.3
15     571.4
16     601.5
17     391.8
18      52.1
19      23.4
20     219.8
21     261.6
22     248.4
23     413.2
24      34.6
25     587.3
26      43.3
27      94.3
28      49.0
29     220.0
       ...
163    318.6
164     98.7
165    405.2
166    575.2
167     57.0
168     17.3
169    364.4
170    222.9
171      6.1
172     58.3
173     63.1
174    366.4
175     75.3
176     81.4
177    124.2
178     57.0
179     62.3
180    496.9
181    158.8
182    550.4
183     48.7
184    499.7
185    376.6
186    136.4
187     50.9
188    443.7
189    116.0
190      6.1
191     57.5
192     90.7
Length: 193, dtype: float64

#### Side note: adding booleans

In [124]:
pd.Series([True, False, True])          # create a boolean Series

0     True
1    False
2     True
dtype: bool

In [125]:
pd.Series([True, False, True]).sum()    # converts False to 0 and True to 1

2

#### Find missing values in a DataFrame

In [126]:
drinks.isnull().head(10)             # DataFrame of booleans

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,True
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,False,False,False,False,False

In [127]:
drinks.isnull().sum()       # count the missing values in each column

country                          0
beer_servings                    0
spirit_servings                  0
wine_servings                    0
total_litres_of_pure_alcohol     0
continent                       23
dtype: int64

#### Drop null values

In [128]:
drinks.dropna().sample(10)             # drop a row if ANY values are missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
168,Tajikistan,2,15,0,0.3,AS
67,Greece,133,112,218,8.3,EU
28,Cote d'Ivoire,37,1,7,4.0,AF
71,Guinea-Bissau,28,31,21,2.5,AF
57,Estonia,224,194,59,9.5,EU
78,Indonesia,5,1,0,0.1,AS
98,Lithuania,343,244,56,12.9,EU
104,Mali,5,1,1,0.6,AF
62,Gabon,347,98,59,8.9,AF
119,Nepal,5,6,0,0.2,AS

In [129]:
drinks.dropna(how='all').sample(10)    # drop a row only if ALL values are missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
8,Australia,261,72,212,10.4,OC
58,Ethiopia,20,3,0,0.7,AF
63,Gambia,8,0,1,2.4,AF
89,Kiribati,21,34,1,1.0,OC
50,Dominica,52,286,26,6.6,NaN
111,Monaco,0,0,0,0.0,EU
26,Burkina Faso,25,7,7,4.3,AF
170,Macedonia,106,27,86,3.9,EU
42,Croatia,230,87,254,10.2,EU
168,Tajikistan,2,15,0,0.3,AS

#### Fill in missing values

In [130]:
drinks.continent.fillna(value='NA', inplace=True)   # fill in missing values with 'NA'

In [131]:
drinks.continent.value_counts()

AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

#### Turn off the missing value filter

In [132]:
drinks = pd.read_csv('https://raw.githubusercontent.com/josephofiowa/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv', header=0, names=drink_cols, na_filter=False)

In [133]:
drinks.head()

       country  beer  spirit  wine  liters continent
0  Afghanistan     0       0     0     0.0        AS
1      Albania    89     132    54     4.9        EU
2      Algeria    25       0    14     0.7        AF
3      Andorra   245     138   312    12.4        EU
4       Angola   217      57    45     5.9        AF

In [134]:
# Quick little example of an exploratory viz you can make with just one line of code!
drinks.groupby('continent').mean()['liters'].sort_values(ascending=False).plot(kind='bar');

### Exercise Three -- For you to complete on your own

#### Read ufo.csv into a DataFrame called 'ufo'
https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/ufo.csv

#### Check the shape of the DataFrame

#### Calculate the most frequent value for each of the columns (in a single command)

#### What are the four most frequent colors reported?

#### For reports in VA, what's the most frequent city?

#### Show only the UFO reports from Arlington, VA

#### Count the number of missing values in each column

#### Show only the UFO reports in which the City is missing

#### How many rows remain if you drop all rows with any missing values?

#### Replace any spaces in the column names with an underscore

#### BONUS: redo the task above, writing generic code to replace spaces with underscores
In other words, your code should not reference the specific column names

#### BONUS: create a new column called 'Location' that includes both City and State
For example, the 'Location' for the first row would be 'Ithaca, NY'

## Split-Apply-Combine
Diagram: http://i.imgur.com/yjNkiwL.png

#### For each continent, calculate the mean beer servings

In [ ]:
drinks.groupby('continent').beer.mean()

#### For each continent, count the number of occurrences

In [ ]:
drinks.continent.value_counts()

#### For each continent, describe beer servings

In [ ]:
drinks.groupby('continent').beer.describe()

#### Similar, but outputs a DataFrame and can be customized

In [ ]:
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max'])

In [ ]:
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max']).sort_values(by='mean')

#### If you don't specify a column to which the aggregation function should be applied, it will be applied to all numeric columns

In [ ]:
drinks.groupby('continent').mean()

In [ ]:
drinks.groupby('continent').describe()

### Exercise Four

#### For each occupation in 'users', count the number of occurrences

#### For each occupation, calculate the mean age

#### BONUS: for each occupation, calculate the minimum and maximum ages

#### BONUS: for each combination of occupation and gender, calculate the mean age